GUdaoxi/demo_qspi/LPTIM16_Timing/Drivers/FM33FH0xx_FL_Driver/Inc/fm33fh0xx_fl_atim.h
#define    ATIM_ECR_FIDX_Pos                                      (5U)
#define    ATIM_ECR_FIDX_Msk                                      (0x1U << ATIM_ECR_FIDX_Pos)
#define    ATIM_ECR_FIDX                                          ATIM_ECR_FIDX_Msk

#define    ATIM_ECR_IDIR_Pos                                      (1U)
#define    ATIM_ECR_IDIR_Msk                                      (0x3U << ATIM_ECR_IDIR_Pos)
#define    ATIM_ECR_IDIR                                          ATIM_ECR_IDIR_Msk

#define    ATIM_ECR_IE_Pos                                        (0U)
#define    ATIM_ECR_IE_Msk                                        (0x1U << ATIM_ECR_IE_Pos)
#define    ATIM_ECR_IE                                            ATIM_ECR_IE_Msk

#define    ATIM_AFR_ETRSEL_Pos                                    (20U)
#define    ATIM_AFR_ETRSEL_Msk                                    (0xfU << ATIM_AFR_ETRSEL_Pos)
#define    ATIM_AFR_ETRSEL                                        ATIM_AFR_ETRSEL_Msk

#define    ATIM_AFR_OCCLR_SEL_Pos                                 (16U)
#define    ATIM_AFR_OCCLR_SEL_Msk                                 (0x7U << ATIM_AFR_OCCLR_SEL_Pos)
#define    ATIM_AFR_OCCLR_SEL                                     ATIM_AFR_OCCLR_SEL_Msk

#define    ATIM_AFR_BKSYS3E_Pos                                   (8U)
#define    ATIM_AFR_BKSYS3E_Msk                                   (0xfU << ATIM_AFR_BKSYS3E_Pos)
#define    ATIM_AFR_BKSYS3E                                       ATIM_AFR_BKSYS3E_Msk

#define    ATIM_AFR_BKIN1E_Pos                                    (0U)
#define    ATIM_AFR_BKIN1E_Msk                                    (0x3fU << ATIM_AFR_BKIN1E_Pos)
#define    ATIM_AFR_BKIN1E                                        ATIM_AFR_BKIN1E_Msk

#define TIM_CCR5_GC5C1_Pos                                         (29U)
#define TIM_CCR5_GC5C1_Msk                                         (0x1UL << TIM_CCR5_GC5C1_Pos)              
#define TIM_CCR5_GC5C1                                              TIM_CCR5_GC5C1_Msk                           
#define TIM_CCR5_GC5C2_Pos                                          (30U)
#define TIM_CCR5_GC5C2_Msk                                          (0x1UL << TIM_CCR5_GC5C2_Pos)               
#define TIM_CCR5_GC5C2                                               TIM_CCR5_GC5C2_Msk                           
#define TIM_CCR5_GC5C3_Pos                                          (31U)
#define TIM_CCR5_GC5C3_Msk                                          (0x1UL << TIM_CCR5_GC5C3_Pos)                
#define TIM_CCR5_GC5C3                                               TIM_CCR5_GC5C3_Msk                         


#define    FL_ATIM_CHANNEL_1                                      0x0U
#define    FL_ATIM_CHANNEL_2                                      0x1U
#define    FL_ATIM_CHANNEL_3                                      0x2U
#define    FL_ATIM_CHANNEL_4                                      0x3U
#define    FL_ATIM_CHANNEL_5                                      0x4U
#define    FL_ATIM_CHANNEL_6                                      0x5U

#define    FL_ATIM_BREAKCHANNEL_0                                 0x0U
#define    FL_ATIM_BREAKCHANNEL_1                                 0x1U



#define    FL_ATIM_CLK_DIVISION_DIV1                              (0x0U << ATIM_CR1_CKD_Pos)
#define    FL_ATIM_CLK_DIVISION_DIV2                              (0x1U << ATIM_CR1_CKD_Pos)
#define    FL_ATIM_CLK_DIVISION_DIV4                              (0x2U << ATIM_CR1_CKD_Pos)


#define    FL_ATIM_COUNTER_ALIGNED_EDGE                           (0x0U << ATIM_CR1_CMS_Pos)
#define    FL_ATIM_COUNTER_ALIGNED_CENTER_DOWN                    (0x1U << ATIM_CR1_CMS_Pos)
#define    FL_ATIM_COUNTER_ALIGNED_CENTER_UP                      (0x2U << ATIM_CR1_CMS_Pos)
#define    FL_ATIM_COUNTER_ALIGNED_CENTER_UP_DOWN                 (0x3U << ATIM_CR1_CMS_Pos)


#define    FL_ATIM_COUNTER_DIR_UP                                 (0x0U << ATIM_CR1_DIR_Pos)
#define    FL_ATIM_COUNTER_DIR_DOWN                               (0x1U << ATIM_CR1_DIR_Pos)


#define    FL_ATIM_ONE_PULSE_MODE_CONTINUOUS                      (0x0U << ATIM_CR1_OPM_Pos)
#define    FL_ATIM_ONE_PULSE_MODE_SINGLE                          (0x1U << ATIM_CR1_OPM_Pos)


#define    FL_ATIM_UPDATE_SOURCE_REGULAR                          (0x0U << ATIM_CR1_URS_Pos)
#define    FL_ATIM_UPDATE_SOURCE_COUNTER                          (0x1U << ATIM_CR1_URS_Pos)


#define    FL_ATIM_TRGO2_UG                                        (0x0U << ATIM_CR2_MMS2_Pos)
#define    FL_ATIM_TRGO2_ENABLE                                    (0x1U << ATIM_CR2_MMS2_Pos)
#define    FL_ATIM_TRGO2_UPDATE                                    (0x2U << ATIM_CR2_MMS2_Pos)
#define    FL_ATIM_TRGO2_CC1IF                                     (0x3U << ATIM_CR2_MMS2_Pos)
#define    FL_ATIM_TRGO2_OC1REF                                    (0x4U << ATIM_CR2_MMS2_Pos)
#define    FL_ATIM_TRGO2_OC2REF                                    (0x5U << ATIM_CR2_MMS2_Pos)
#define    FL_ATIM_TRGO2_OC3REF                                    (0x6U << ATIM_CR2_MMS2_Pos)
#define    FL_ATIM_TRGO2_OC4REF                                    (0x7U << ATIM_CR2_MMS2_Pos)
#define    FL_ATIM_TRGO2_OC5REF                                    (0x8U << ATIM_CR2_MMS2_Pos)
#define    FL_ATIM_TRGO2_OC6REF                                    (0x9U << ATIM_CR2_MMS2_Pos)
#define    FL_ATIM_TRGO2_OC4REF_RISINGFALLING                      (0xaU << ATIM_CR2_MMS2_Pos)
#define    FL_ATIM_TRGO2_OC6REF_RISINGFALLING                      (0xbU << ATIM_CR2_MMS2_Pos)
#define    FL_ATIM_TRGO2_OC4REF_RISING_OC6REF_RISING               (0xcU << ATIM_CR2_MMS2_Pos)
#define    FL_ATIM_TRGO2_OC4REF_RISING_OC6REF_FALLING              (0xdU << ATIM_CR2_MMS2_Pos)
#define    FL_ATIM_TRGO2_OC5REF_RISING_OC6REF_RISING               (0xeU << ATIM_CR2_MMS2_Pos)
#define    FL_ATIM_TRGO2_OC5REF_RISING_OC6REF_FALLING              (0xfU << ATIM_CR2_MMS2_Pos)


#define    FL_ATIM_OCN_IDLE_STATE_LOW                             (0x0U << ATIM_CR2_OISN_Pos)
#define    FL_ATIM_OCN_IDLE_STATE_HIGH                            (0x1U << ATIM_CR2_OISN_Pos)


